virtualabs/cutcutgo/cutcutgo.X/src/packs/ATSAMA5D27CD1G_DFP/component/twihs.h
/* -------- TWIHS_FIER : (TWIHS Offset: 0x64) ( /W 32) FIFO Interrupt Enable Register -------- */
#define TWIHS_FIER_TXFEF_Pos                  _U_(0)                                               /**< (TWIHS_FIER) TXFEF Interrupt Enable Position */
#define TWIHS_FIER_TXFEF_Msk                  (_U_(0x1) << TWIHS_FIER_TXFEF_Pos)                   /**< (TWIHS_FIER) TXFEF Interrupt Enable Mask */
#define TWIHS_FIER_TXFEF(value)               (TWIHS_FIER_TXFEF_Msk & ((value) << TWIHS_FIER_TXFEF_Pos))
#define TWIHS_FIER_TXFFF_Pos                  _U_(1)                                               /**< (TWIHS_FIER) TXFFF Interrupt Enable Position */
#define TWIHS_FIER_TXFFF_Msk                  (_U_(0x1) << TWIHS_FIER_TXFFF_Pos)                   /**< (TWIHS_FIER) TXFFF Interrupt Enable Mask */
#define TWIHS_FIER_TXFFF(value)               (TWIHS_FIER_TXFFF_Msk & ((value) << TWIHS_FIER_TXFFF_Pos))
#define TWIHS_FIER_TXFTHF_Pos                 _U_(2)                                               /**< (TWIHS_FIER) TXFTHF Interrupt Enable Position */
#define TWIHS_FIER_TXFTHF_Msk                 (_U_(0x1) << TWIHS_FIER_TXFTHF_Pos)                  /**< (TWIHS_FIER) TXFTHF Interrupt Enable Mask */
#define TWIHS_FIER_TXFTHF(value)              (TWIHS_FIER_TXFTHF_Msk & ((value) << TWIHS_FIER_TXFTHF_Pos))
#define TWIHS_FIER_RXFEF_Pos                  _U_(3)                                               /**< (TWIHS_FIER) RXFEF Interrupt Enable Position */
#define TWIHS_FIER_RXFEF_Msk                  (_U_(0x1) << TWIHS_FIER_RXFEF_Pos)                   /**< (TWIHS_FIER) RXFEF Interrupt Enable Mask */
#define TWIHS_FIER_RXFEF(value)               (TWIHS_FIER_RXFEF_Msk & ((value) << TWIHS_FIER_RXFEF_Pos))
#define TWIHS_FIER_RXFFF_Pos                  _U_(4)                                               /**< (TWIHS_FIER) RXFFF Interrupt Enable Position */
#define TWIHS_FIER_RXFFF_Msk                  (_U_(0x1) << TWIHS_FIER_RXFFF_Pos)                   /**< (TWIHS_FIER) RXFFF Interrupt Enable Mask */
#define TWIHS_FIER_RXFFF(value)               (TWIHS_FIER_RXFFF_Msk & ((value) << TWIHS_FIER_RXFFF_Pos))
#define TWIHS_FIER_RXFTHF_Pos                 _U_(5)                                               /**< (TWIHS_FIER) RXFTHF Interrupt Enable Position */
#define TWIHS_FIER_RXFTHF_Msk                 (_U_(0x1) << TWIHS_FIER_RXFTHF_Pos)                  /**< (TWIHS_FIER) RXFTHF Interrupt Enable Mask */
#define TWIHS_FIER_RXFTHF(value)              (TWIHS_FIER_RXFTHF_Msk & ((value) << TWIHS_FIER_RXFTHF_Pos))
#define TWIHS_FIER_TXFPTEF_Pos                _U_(6)                                               /**< (TWIHS_FIER) TXFPTEF Interrupt Enable Position */
#define TWIHS_FIER_TXFPTEF_Msk                (_U_(0x1) << TWIHS_FIER_TXFPTEF_Pos)                 /**< (TWIHS_FIER) TXFPTEF Interrupt Enable Mask */
#define TWIHS_FIER_TXFPTEF(value)             (TWIHS_FIER_TXFPTEF_Msk & ((value) << TWIHS_FIER_TXFPTEF_Pos))
#define TWIHS_FIER_RXFPTEF_Pos                _U_(7)                                               /**< (TWIHS_FIER) RXFPTEF Interrupt Enable Position */
#define TWIHS_FIER_RXFPTEF_Msk                (_U_(0x1) << TWIHS_FIER_RXFPTEF_Pos)                 /**< (TWIHS_FIER) RXFPTEF Interrupt Enable Mask */
#define TWIHS_FIER_RXFPTEF(value)             (TWIHS_FIER_RXFPTEF_Msk & ((value) << TWIHS_FIER_RXFPTEF_Pos))
#define TWIHS_FIER_Msk                        _U_(0x000000FF)                                      /**< (TWIHS_FIER) Register Mask  */


/* -------- TWIHS_FIDR : (TWIHS Offset: 0x68) ( /W 32) FIFO Interrupt Disable Register -------- */
#define TWIHS_FIDR_TXFEF_Pos                  _U_(0)                                               /**< (TWIHS_FIDR) TXFEF Interrupt Disable Position */
#define TWIHS_FIDR_TXFEF_Msk                  (_U_(0x1) << TWIHS_FIDR_TXFEF_Pos)                   /**< (TWIHS_FIDR) TXFEF Interrupt Disable Mask */
#define TWIHS_FIDR_TXFEF(value)               (TWIHS_FIDR_TXFEF_Msk & ((value) << TWIHS_FIDR_TXFEF_Pos))
#define TWIHS_FIDR_TXFFF_Pos                  _U_(1)                                               /**< (TWIHS_FIDR) TXFFF Interrupt Disable Position */
#define TWIHS_FIDR_TXFFF_Msk                  (_U_(0x1) << TWIHS_FIDR_TXFFF_Pos)                   /**< (TWIHS_FIDR) TXFFF Interrupt Disable Mask */
#define TWIHS_FIDR_TXFFF(value)               (TWIHS_FIDR_TXFFF_Msk & ((value) << TWIHS_FIDR_TXFFF_Pos))
#define TWIHS_FIDR_TXFTHF_Pos                 _U_(2)                                               /**< (TWIHS_FIDR) TXFTHF Interrupt Disable Position */
#define TWIHS_FIDR_TXFTHF_Msk                 (_U_(0x1) << TWIHS_FIDR_TXFTHF_Pos)                  /**< (TWIHS_FIDR) TXFTHF Interrupt Disable Mask */
#define TWIHS_FIDR_TXFTHF(value)              (TWIHS_FIDR_TXFTHF_Msk & ((value) << TWIHS_FIDR_TXFTHF_Pos))
#define TWIHS_FIDR_RXFEF_Pos                  _U_(3)                                               /**< (TWIHS_FIDR) RXFEF Interrupt Disable Position */
#define TWIHS_FIDR_RXFEF_Msk                  (_U_(0x1) << TWIHS_FIDR_RXFEF_Pos)                   /**< (TWIHS_FIDR) RXFEF Interrupt Disable Mask */
#define TWIHS_FIDR_RXFEF(value)               (TWIHS_FIDR_RXFEF_Msk & ((value) << TWIHS_FIDR_RXFEF_Pos))
#define TWIHS_FIDR_RXFFF_Pos                  _U_(4)                                               /**< (TWIHS_FIDR) RXFFF Interrupt Disable Position */
#define TWIHS_FIDR_RXFFF_Msk                  (_U_(0x1) << TWIHS_FIDR_RXFFF_Pos)                   /**< (TWIHS_FIDR) RXFFF Interrupt Disable Mask */
#define TWIHS_FIDR_RXFFF(value)               (TWIHS_FIDR_RXFFF_Msk & ((value) << TWIHS_FIDR_RXFFF_Pos))
#define TWIHS_FIDR_RXFTHF_Pos                 _U_(5)                                               /**< (TWIHS_FIDR) RXFTHF Interrupt Disable Position */
#define TWIHS_FIDR_RXFTHF_Msk                 (_U_(0x1) << TWIHS_FIDR_RXFTHF_Pos)                  /**< (TWIHS_FIDR) RXFTHF Interrupt Disable Mask */
#define TWIHS_FIDR_RXFTHF(value)              (TWIHS_FIDR_RXFTHF_Msk & ((value) << TWIHS_FIDR_RXFTHF_Pos))
#define TWIHS_FIDR_TXFPTEF_Pos                _U_(6)                                               /**< (TWIHS_FIDR) TXFPTEF Interrupt Disable Position */
#define TWIHS_FIDR_TXFPTEF_Msk                (_U_(0x1) << TWIHS_FIDR_TXFPTEF_Pos)                 /**< (TWIHS_FIDR) TXFPTEF Interrupt Disable Mask */
#define TWIHS_FIDR_TXFPTEF(value)             (TWIHS_FIDR_TXFPTEF_Msk & ((value) << TWIHS_FIDR_TXFPTEF_Pos))
#define TWIHS_FIDR_RXFPTEF_Pos                _U_(7)                                               /**< (TWIHS_FIDR) RXFPTEF Interrupt Disable Position */
#define TWIHS_FIDR_RXFPTEF_Msk                (_U_(0x1) << TWIHS_FIDR_RXFPTEF_Pos)                 /**< (TWIHS_FIDR) RXFPTEF Interrupt Disable Mask */
#define TWIHS_FIDR_RXFPTEF(value)             (TWIHS_FIDR_RXFPTEF_Msk & ((value) << TWIHS_FIDR_RXFPTEF_Pos))
#define TWIHS_FIDR_Msk                        _U_(0x000000FF)                                      /**< (TWIHS_FIDR) Register Mask  */


